InformationRegisters/НастройкиЖурналаПравокЗаднимЧислом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЖурналаПравокЗаднимЧислом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контролировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиЖурналаПравокЗаднимЧислом/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВсеДокументы = Документы.ТипВсеСсылки();
	МассивТипов = ВсеДокументы.Типы();
	
	Для Каждого Тип Из МассивТипов Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
		СинонимНаименованияОбъекта = МетаданныеОбъекта.Синоним;
		
		ТипОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
		
		
		НаборЗаписей = РегистрыСведений.НастройкиЖурналаПравокЗаднимЧислом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипОбъекта.Установить(ТипОбъекта);
		НаборЗаписей.Отбор.ТипОбъекта.Использование = Истина;
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			Если НЕ СтрНайти(НРег(СинонимНаименованияОбъекта), "(не используется)") = 0 Тогда				
				НаборЗаписей.Удалить(0);
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("УдалениеНеиспользуемых", Истина);
				НаборЗаписей.Записать();
			КонецЕсли;
		Иначе
			Если СтрНайти(НРег(СинонимНаименованияОбъекта), "(не используется)") = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТипОбъекта = ТипОбъекта;	
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьДляВсех(Команда)
	УстановитьВариантКонтроляДляВыделенныхСтрок(Истина);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура НеКонтролироватьДляВсех(Команда)
	УстановитьВариантКонтроляДляВыделенныхСтрок(Ложь);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантКонтроляДляВыделенныхСтрок(Знач Контролировать)
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		ЗаписатьНастройкуКонтроляПоДокументу(СтрокаСписка.ТипОбъекта, Контролировать);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуКонтроляПоДокументу(Знач ТипОбъекта, Знач Контролировать)
	
	Если ТипЗнч(ТипОбъекта) <> Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
		ТипОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	КонецЕсли;
	
	Настройка = РегистрыСведений.НастройкиЖурналаПравокЗаднимЧислом.СоздатьМенеджерЗаписи();
	Настройка.ТипОбъекта = ТипОбъекта;	
	Настройка.Контролировать = Контролировать;
	Настройка.Записать(Истина);
	
КонецПроцедуры
